---
kind: type
id: T:Autodesk.Revit.DB.DeleteElements
source: html/f8d66e28-6e49-7b79-42e5-aa92ee9e536f.htm
---
# Autodesk.Revit.DB.DeleteElements

Deletes element(s) related to the failure.

## Syntax (C#)
```csharp
public class DeleteElements : FailureResolution
```